<a href="https://colab.research.google.com/github/maro000/for_data_analysis_and_visualization/blob/master/groupby.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import numpy as np
import pandas as pd 
from pandas import DataFrame

In [0]:
dframe = DataFrame({'k1':['X','X','Y','Y','Z'],
                    'k2':['alpha','beta','alpha','beta','alpha'],
                    'dataset1':np.random.randn(5),
                    'dataset2':np.random.randn(5)})

In [4]:
dframe

  k1     k2  dataset1  dataset2
0  X  alpha  1.578703 -1.701518
1  X   beta  0.728101  0.119759
2  Y  alpha -0.590108 -1.293751
3  Y   beta -0.938681 -0.167727
4  Z  alpha  0.076597  1.492595

In [0]:
group1  = dframe['dataset1'].groupby(dframe['k1'])

In [7]:
group1

In [8]:
group1

In [10]:
group1.mean()

k1
X    1.153402
Y   -0.764395
Z    0.076597
Name: dataset1, dtype: float64

In [0]:
cities = np.array(['NY','LA','LA','NY','NY'])

In [0]:
month = np.array(['JAN','FEB','JAN','FEB','JAN'])

In [13]:
dframe['dataset1'].groupby([cities,month]).mean()

LA  FEB    0.728101
    JAN   -0.590108
NY  FEB   -0.938681
    JAN    0.827650
Name: dataset1, dtype: float64

In [15]:
dframe

  k1     k2  dataset1  dataset2
0  X  alpha  1.578703 -1.701518
1  X   beta  0.728101  0.119759
2  Y  alpha -0.590108 -1.293751
3  Y   beta -0.938681 -0.167727
4  Z  alpha  0.076597  1.492595

In [17]:
dframe.groupby('k1').mean()

    dataset1  dataset2
k1
X   1.153402 -0.790880
Y  -0.764395 -0.730739
Z   0.076597  1.492595

In [18]:
dframe.groupby(['k1','k2']).mean()

          dataset1  dataset2
k1 k2
X  alpha  1.578703 -1.701518
   beta   0.728101  0.119759
Y  alpha -0.590108 -1.293751
   beta  -0.938681 -0.167727
Z  alpha  0.076597  1.492595